{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "6a63cbad",
   "metadata": {},
   "source": [
    "# 2.4 Тренажер по модулю"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5b878219",
   "metadata": {},
   "source": [
    "## Step 1 Задача\n",
    "\n",
    "Даны n точек на плоскости найти центр и минимальный радиус круга, куда попадут все эти точки.\n",
    "\n",
    "**Входные данные:**\n",
    "\n",
    "* количество точек n (целое число);\n",
    "* n строк, на каждой через пробел записаны координаты точки (вещественные числа).\n",
    "\n",
    "**Выходные данные:**\n",
    "\n",
    "* координаты центра круга;\n",
    "* радиус.\n",
    "\n",
    "Для вывода используйте следующий шаблон:\n",
    "```\n",
    "\"центр в точке (%6.3f, %6.3f), r = %6.3f\"\n",
    "```\n",
    "**Пояснение.**\n",
    "\n",
    "* Создать массив точек points.\n",
    "* Найти координаты \"средней\" точки (среднее значение каждой координаты массива точек) - это центр круга.\n",
    "* Сформировать массив расстояний от средней точки до каждой точки массива points, используя формулу расстояния между двумя точками);\n",
    "* Найти максимальное расстояние - это радиус круга.\n",
    "\n",
    "___\n",
    "\n",
    "**Не проходит 13 тест...**\n",
    "\n",
    "Если средняя точка в программе вычисляется так:\n",
    "```python\n",
    "x_mean = np.mean(points[:, 0])\n",
    "y_mean = np.mean(points[:, 1])\n",
    "```\n",
    "то при выводе координат без формата получается:\n",
    "```\n",
    "-4.4875, 2.4750000000000005\n",
    "```\n",
    "с использованием формата (в котором используется \"банковское\" округление):\n",
    "```\n",
    "центр в точке (-4.487, 2.475)\n",
    "```\n",
    "Если же применить метод, описанный в этом модуле: \n",
    "```python\n",
    "x_y_avg = np.mean(points, 0)\n",
    "x_avg = x_y_avg[0]\n",
    "y_avg = x_y_avg[1]\n",
    "```\n",
    "то при выводе координат без формата получается:\n",
    "```\n",
    "-4.487500000000001, 2.4750000000000005\n",
    "```\n",
    "С использованием формата:\n",
    "```\n",
    "центр в точке (-4.488,  2.475)\n",
    "```\n",
    "Чтобы задача прошла, необходимо использовать второй способ.\n",
    "\n",
    "___\n",
    "\n",
    "**Sample Input 1:**\n",
    "```\n",
    "4\n",
    "13.5 -5.7\n",
    "17.8 -17.6\n",
    "-8.1 16.9\n",
    "10.6 14.9\n",
    "```\n",
    "**Sample Output 1:**\n",
    "```\n",
    "центр в точке ( 8.450,  2.125), r = 22.186\n",
    "```\n",
    "___\n",
    "\n",
    "**Sample Input 2:**\n",
    "```\n",
    "5\n",
    "13.6 -9.3\n",
    "-19.4 -15.4\n",
    "12.8 15.5\n",
    "-10.8 -7.5\n",
    "-4.4 -0.3\n",
    "```\n",
    "**Sample Output 2:**\n",
    "```\n",
    "центр в точке (-1.640, -3.400), r = 23.785\n",
    "```\n",
    "___\n",
    "\n",
    "**Sample Input 3:**\n",
    "```\n",
    "12\n",
    "1.5 17.9\n",
    "17.8 8.0\n",
    "-1.8 -13.9\n",
    "-16.2 17.4\n",
    "1.9 -6.9\n",
    "-12.6 -8.9\n",
    "14.2 -3.8\n",
    "15.1 -12.1\n",
    "-8.6 -10.4\n",
    "14.8 13.0\n",
    "7.9 7.7\n",
    "1.8 17.8\n",
    "```\n",
    "**Sample Output 3:**\n",
    "```\n",
    "центр в точке ( 2.983,  2.150), r = 24.506\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "01e60cb8",
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np\n",
    "\n",
    "# n = int(input())\n",
    "# points = np.array([input().split() for _ in range(n)], dtype=float)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "d7544b44",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Test 3\n",
    "inpt = \"\"\"12\n",
    "1.5 17.9\n",
    "17.8 8.0\n",
    "-1.8 -13.9\n",
    "-16.2 17.4\n",
    "1.9 -6.9\n",
    "-12.6 -8.9\n",
    "14.2 -3.8\n",
    "15.1 -12.1\n",
    "-8.6 -10.4\n",
    "14.8 13.0\n",
    "7.9 7.7\n",
    "1.8 17.8\"\"\"\n",
    "inpt_lines = inpt.split('\\n')\n",
    "\n",
    "n = int(inpt_lines[0])\n",
    "points = np.array([inpt_lines[l].split() for l in range(1, n + 1)], dtype=float)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "b311ac4d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "центр в точке ( 2.983,  2.150), r = 24.506\n"
     ]
    }
   ],
   "source": [
    "# средняя точка\n",
    "center = np.mean(points, 0)\n",
    "\n",
    "# расстояния точек от центра\n",
    "rc = np.sqrt(np.sum((points - center)**2, 1))\n",
    "r_max = rc.max()\n",
    "\n",
    "print(\"центр в точке (%6.3f, %6.3f), r = %6.3f\" % (center[0], center[1], r_max))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "200bd70a",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "698ae14e",
   "metadata": {},
   "source": [
    "## Step 2 Задача\n",
    "\n",
    "Электрическая цепь состоит из n ветвей, каждая ветвь состоит из резистора и источника ЭДС включенных последовательно. Известны сопротивление резистора r каждой ветви  и сила тока в каждой ветви i.\n",
    "\n",
    "Все n ветвей соединены параллельно. Направления токов в ветвях одинаковые. Посчитать:\n",
    "\n",
    "* эквивалентное сопротивление цепи 1/R = 1/r0 + 1/r1 + ...\n",
    "* силу тока в цепи I = i1 + i2 + ...\n",
    "* напряжение U = I * R\n",
    "\n",
    "**Входные данные:**\n",
    "\n",
    "* строка, в которой через пробелы перечислены значения сопротивления на каждом резисторе (вещественные числа);\n",
    "* строка, в которой через пробелы перечислены значения силы тока на каждом резисторе (вещественные числа).\n",
    "\n",
    "**Выходные данные:**\n",
    "\n",
    "* значение общего сопротивления цепи;\n",
    "* сила тока;\n",
    "* напряжение. \n",
    "\n",
    "Для вывода использовать формат:\n",
    "```\n",
    "\"R = %6.3f Ом, I = %6.3f А, U = %6.3f В\"\n",
    "```\n",
    "___\n",
    "\n",
    "**Sample Input 1:**\n",
    "```\n",
    "0.9 1.3 0.9 1.0 0.6 0.9 1.5 1.0 1.6 0.9 0.9 1.6\n",
    "3.0 3.0 4.1 4.0 3.3 2.9 4.2 2.8 3.6 2.7 2.6 3.6\n",
    "```\n",
    "**Sample Output 1:**\n",
    "```\n",
    "R =  0.084 Ом, I = 39.800 А, U =  3.342 В\n",
    "```\n",
    "___\n",
    "\n",
    "**Sample Input 2:**\n",
    "```\n",
    "0.9 0.6 1.3 1.6 1.6 0.9 0.9 1.4 1.5 0.6\n",
    "4.1 3.7 2.9 2.8 2.9 2.6 4.2 3.2 2.8 2.8\n",
    "```\n",
    "**Sample Output 2:**\n",
    "```\n",
    "R =  0.099 Ом, I = 32.000 А, U =  3.179 В\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "f6824060",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.9 1.3 0.9 1.0 0.6 0.9 1.5 1.0 1.6 0.9 0.9 1.6\n",
      "3.0 3.0 4.1 4.0 3.3 2.9 4.2 2.8 3.6 2.7 2.6 3.6\n",
      "R =  0.084 Ом, I = 39.800 А, U =  3.342 В\n"
     ]
    }
   ],
   "source": [
    "import numpy as np\n",
    "\n",
    "# r = np.array(input().split(), dtype=float)\n",
    "# i = np.array(input().split(), dtype=float) \n",
    "\n",
    "r = np.array(input().split(), dtype=float)\n",
    "# i = np.array(input().split(), dtype=float) \n",
    "\n",
    "R_inv = np.sum(1 / r)\n",
    "R = 1 / R_inv\n",
    "\n",
    "I = np.sum(i)\n",
    "\n",
    "U = I * R\n",
    "\n",
    "print(\"R = %6.3f Ом, I = %6.3f А, U = %6.3f В\" % (R, I, U))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "54257ac6",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
